driver-tests/bpelse/POJOCalls/testXPathApplication/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:per="http://xml.netbeans.org/schema/personAddress">
  <soapenv:Body>
    <per:person>
      <per:firstName>John</per:firstName>
      <per:lastName>Doe</per:lastName>
      <!--1 or more repetitions:-->
      <per:address>
        <per:street1>800 Royal oaks</per:street1>
        <per:city>Monrovia</per:city>
        <per:state>CA</per:state>
      </per:address>
      <per:address>
        <per:street1>1400 Myrtle</per:street1>
        <per:city>Monrovia</per:city>
        <per:state>CA</per:state>
      </per:address>
      <per:address>
        <per:street1>140 Foothill Boulevard</per:street1>
        <per:street2>Attn: John Doe</per:street2>
        <per:city>Monrovia</per:city>
        <per:state>CA</per:state>
      </per:address>
      <per:address>
        <per:street1>1144 Huntington Dr</per:street1>
        <per:street2>#14</per:street2>
        <per:city>Arcadia</per:city>
        <per:state>CA</per:state>
      </per:address>
    </per:person>
  </soapenv:Body>
</soapenv:Envelope>